
local function run(msg, matches)
if matches[1] == 'الاوامر' and is_owner(msg) then
 local help = [[<b>
اهلا صديقي في اوامر سورس 
DEV FAEDER  :man::wrench::white_check_mark:
اوامر المجموعه لا تحتاج استخدام [/#!] :man::wrench:¦
---------------------------------------------------
تفعيل ➪ لتفعيل بوت 
تعطيل ➪ لتعطيل بوت 
اذاعه ➪ اذاعه
احذف ➪ لحذف رساله بلرد
ايدي ➪ لعرض الايدي
---------------------------------------------------
setowner ➪ لرفع مدير
Promote ➪ لرفع ادمن 
demote ➪ لتنزيل ادمن
owner ➪ لعرض المدير
---------------------------------------------------
تثبيت ➪ تثبيت رساله 
الغاء تثبيت ➪ لـ الغاء تثبيت
الاعدادات ➪ لعرض  اعدادات المجموعه
---------------------------------------------------  
اوامر القفل والفتح  :man::wrench:¦
قفل - او فتح + الامر لقفل امر محدد
---------------------------------------------------
التوجيه :recycle:
الروابط :loop:
الكلايش :bookmark_tabs:
التعديل :paperclip:

---------------------------------------------------
اوامر الميديا :man::wrench:¦ افتح - اقفل + الامر
---------------------------------------------------
الصور :camera:
الفيديو :video_camera:
الصوت :loudspeaker:
الصوتيات 🔈
المتحركه 🎞
الدردشه 🖋
</code> <i>
CH BOT : @TEAM_FAEDET
]]

               tg.sendMessage(msg.chat_id_, 0, 1, help, 1, 'html')

end
end
return {
  patterns = {
    "^(الاوامر)$",
  },
  run = run
}
